In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar','foo', 'bar', 'foo', 'foo'],
                   'B' : ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
                   'C' : np.random.randn(8),
                   'D' : np.random.randn(8)})
df

     A      B         C         D
0  foo    one -0.286479 -1.273283
1  bar    one  0.373677  0.048564
2  foo    two  0.722407 -0.182267
3  bar  three  0.503881 -0.022632
4  foo    two -0.502344  1.305874
5  bar    two  0.448360 -0.123686
6  foo    one  0.021093 -1.033237
7  foo  three  0.894648 -1.181768

In [6]:
grouped = df.groupby(['A', 'B'])
grouped.sum()

                  C         D
A   B
bar one    0.373677  0.048564
    three  0.503881 -0.022632
    two    0.448360 -0.123686
foo one   -0.265386 -2.306520
    three  0.894648 -1.181768
    two    0.220063  1.123607

In [8]:
lst = [1, 2, 3, 1, 2, 3]
s = pd.Series([1, 2, 3, 10, 20, 30], index = lst)
s

1     1
2     2
3     3
1    10
2    20
3    30
dtype: int64

In [15]:
group = s.groupby(level=0)
group.mean()

1     5.5
2    11.0
3    16.5
dtype: float64